Reports/ОтчетПоСверкеСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Report>
		<Properties>
			<Name>ОтчетПоСверкеСертификатов</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ВыдачаПодарков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ВыдачаПодарков</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Причины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСертификата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подарок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаСделку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипДокумента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Клиенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>Клиенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗвонить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРассылатьСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРассылатьПочту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННВведенКорректно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КППВведенКорректно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВИП</Name>
					<Comment>V.I.P.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>38</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияЭлемента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ОтчетПоСверкеСертификатов/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

Процедура СформироватьОтчет(Результат, КомпоновщикНастроек, ДанныеРасшифровки) Экспорт
		
	ТЗДляОтчета = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВыдачаПодарков.Сделка КАК Ссылка,
	//Для исторических данных
	|	ВыдачаПодарков.Сделка.GUID_ИсторическойСделкиСРМ КАК GUID_ИсторическойСделкиСРМ
	|ИЗ
	|	РегистрСведений.ВыдачаПодарков КАК ВыдачаПодарков
	|ГДЕ
	|	ВыдачаПодарков.Регистратор.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ВыдачаПодарков.Причина.ВыдачаСертификата
	|	И &Подарок
	|	И &Причина
	|	И &Проект
	|	И &Клиент
	|	И &Менеджер";
	
	пПроект = КомпоновщикНастроек.ПараметрыДанных.Элементы.Найти("Проект");
	Если пПроект <> Неопределено
			И пПроект.Использование Тогда
		Запрос.УстановитьПараметр("Проект", пПроект.Значение);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &Проект", " И ВыдачаПодарков.Проект = &Проект");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &Проект", "");
	КонецЕсли;	
	
	ВыполнитьКорректировкуТекстаЗапроса(Запрос, КомпоновщикНастроек);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	МассивУИДов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		//Для исторических данных
		Если Выборка.GUID_ИсторическойСделкиСРМ <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000") Тогда
			МассивУИДов.Добавить(Выборка.GUID_ИсторическойСделкиСРМ);
		Иначе
			МассивУИДов.Добавить(Выборка.Ссылка.УникальныйИдентификатор());	
		КонецЕсли;
			
	КонецЦикла;
	
	Если пПроект <> Неопределено
			И ЗначениеЗаполнено(пПроект.Значение) Тогда
	
		БазаDS = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(пПроект.Значение, "ПроектБазыДомостроителя");
		
	Иначе
		
		БазаDS = Ложь;
	
	КонецЕсли;
	
	ПроксиСервер 	= Неопределено;
	ИмяСервиса 		= "ReportCRM";
	CRMСервер.ПодключитьсяКСервису(ПроксиСервер, БазаDS, ИмяСервиса);	

	ТЗ 				= ПроксиСервер.ReturnReport(ЗначениеВСтрокуВнутр(МассивУИДов));
	ТаблицаСопуток 	= ЗначениеИзСтрокиВнутр(ТЗ);
	ТЗ 				= Неопределено;
	ПроксиСервер 	= Неопределено;
	Массив 			= Новый Массив;
	Массив.Добавить(Тип("ДокументСсылка.ЗаявкаНаСделку"));
	ОписаниеТиповС 	= Новый ОписаниеТипов(Массив);
	ТаблицаСопуток.Колонки.Добавить("СсылкаНаСделку", ОписаниеТиповС);
	
	Для Каждого Стр из ТаблицаСопуток Цикл
		Стр.СсылкаНаСделку = Документы.ЗаявкаНаСделку.ПолучитьСсылку(Стр.СделкаCRM);
		//Для исторических данных
		Если СтрНайти(Строка(Стр.СсылкаНаСделку), "не найден") > 0 Тогда
			Стр.СсылкаНаСделку = Документы.ЗаявкаНаСделку.НайтиПоРеквизиту("GUID_ИсторическойСделкиСРМ", Стр.СделкаCRM);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТЗ", ТаблицаСопуток);
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	ТЗ.НомерСертификата КАК НомерСертификата,
	|	ТЗ.НаименованиеСертификата КАК НаименованиеСертификата,
	|	ТЗ.КодСертификата КАК КодСертификата,
	|	ТЗ.ПолучательВУПН КАК ПолучательВУПН,
	|	ТЗ.КодСделки КАК КодСделки,
	|	ТЗ.СуммаДоговора КАК СуммаДоговора,
	|	ТЗ.СсылкаНаСделку КАК СсылкаНаСделку
	|ПОМЕСТИТЬ СертификатыИЗУПН
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Клиенты.ОсновнойТелефон КАК ОсновнойТелефон,
	|	Клиенты.GUID КАК GUID
	|ПОМЕСТИТЬ ВТ_Клиенты
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	НЕ Клиенты.GUID = """"
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	GUID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаПодарков.Подарок КАК Номенклатура,
	|	ВыдачаПодарков.Проект КАК Проект,
	|	ВыдачаПодарков.Регистратор КАК ВыдачаПодарков,
	|	ЗаявкаНаСделку.ТипСертификата КАК ТипСертификата,
	|	ВыдачаПодарков.Сделка КАК ЗаявкаНаСделку,
	|	ВыдачаПодарков.Ответственный КАК Менеджер,
	|	ВыдачаПодарков.Регистратор.Автор КАК Автор,
	|	ПОДСТРОКА(ВыдачаПодарков.НомерСертификата, 0, 2) + "" "" + ПОДСТРОКА(ВыдачаПодарков.НомерСертификата, 3, 2) + "" №"" + ПОДСТРОКА(ВыдачаПодарков.НомерСертификата, 5, 4) КАК НомерСертификатаCRM,
	|	СертификатыИЗУПН.НомерСертификата КАК НомерСертификатаУПН,
	|	СертификатыИЗУПН.КодСделки КАК Сделка,
	|	СертификатыИЗУПН.ПолучательВУПН КАК ПолучательВУПН,
	|	СертификатыИЗУПН.СуммаДоговора КАК СуммаДоговора,
	|	ВыдачаПодарков.Регистратор.Дата КАК ВыдачаПодарковДата,
	|	ВыдачаПодарков.Регистратор.Клиент КАК Клиент,
	|	ЕСТЬNULL(Клиенты.ОсновнойТелефон, 0) КАК Телефон
	|ИЗ
	|	РегистрСведений.ВыдачаПодарков КАК ВыдачаПодарков
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаСделку КАК ЗаявкаНаСделку
	|			ЛЕВОЕ СОЕДИНЕНИЕ СертификатыИЗУПН КАК СертификатыИЗУПН
	|			ПО ЗаявкаНаСделку.ТипСертификата.Код = СертификатыИЗУПН.КодСертификата
	|				И ЗаявкаНаСделку.Ссылка = СертификатыИЗУПН.СсылкаНаСделку
	|		ПО ВыдачаПодарков.Сделка = ЗаявкаНаСделку.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Клиенты КАК Клиенты
	|		ПО (НЕ ВыдачаПодарков.Регистратор.Клиент.GUID = """")
	|			И ВыдачаПодарков.Регистратор.Клиент.GUID = Клиенты.GUID
	|ГДЕ
	|	ВыдачаПодарков.Регистратор.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ВыдачаПодарков.Причина.ВыдачаСертификата
	|	И &Подарок
	|	И &Причина
	|	И &Проект
	|	И &Клиент
	|	И &Менеджер";
	
	пПроект = КомпоновщикНастроек.ПараметрыДанных.Элементы.Найти("Проект");
	Если пПроект <> Неопределено
			И пПроект.Использование Тогда
		Запрос.УстановитьПараметр("Проект", пПроект.Значение);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &Проект", " И ВыдачаПодарков.Проект = &Проект");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &Проект", "");
	КонецЕсли;	
	
	ВыполнитьКорректировкуТекстаЗапроса(Запрос, КомпоновщикНастроек);	
	
	ТЗДляОтчета 	= Запрос.Выполнить().Выгрузить();	
	НаборыДанных 	= Новый Структура("ТЗДляОтчета", ТЗДляОтчета); 
			   
	ДанныеРасшифровки 			= Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета 			= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных 		= КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, НаборыДанных, ДанныеРасшифровки, Истина);
			  
	Результат.Очистить();
	ДокументРезультат = Результат;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;	
	
	ПроцессорВывода.УстановитьДокумент(Результат);
		
	ПроцессорВывода.НачатьВывод();
	
	ТаблицаЗафиксирована = Ложь;
	Пока Истина Цикл
		сч = ДанныеРасшифровки.Элементы.Количество();
		ЭлементРезультата = ПроцессорКомпоновкиДанных.Следующий();
		Если ЭлементРезультата= Неопределено Тогда
			Прервать;                                
		Иначе
			ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
			Если Не ТаблицаЗафиксирована
				И ЭлементРезультата.ЗначенияПараметров.Количество() >  0 Тогда			
				ТаблицаЗафиксирована = Истина;
				Результат.ФиксацияСверху = 5;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ПроцессорВывода.ЗакончитьВывод();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	НастройкиКД = КомпоновщикНастроек.ПолучитьНастройки();
	
	СтандартнаяОбработка = Ложь;
	
	СформироватьОтчет(ДокументРезультат, НастройкиКД, ДанныеРасшифровки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьКорректировкуТекстаЗапроса(Запрос, КомпоновщикНастроек)

	пПериод = КомпоновщикНастроек.ПараметрыДанных.Элементы.Найти("Период");
	Если пПериод.Использование  Тогда
		Запрос.УстановитьПараметр("ДатаНачала", пПериод.Значение.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", пПериод.Значение.ДатаОкончания);		
	КонецЕсли;
		
	пНоменклатура = КомпоновщикНастроек.ПараметрыДанных.Элементы.Найти("Номенклатура");
	Если пНоменклатура <> Неопределено
			И пНоменклатура.Использование Тогда
		Запрос.УстановитьПараметр("Подарок", пНоменклатура.Значение);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &Подарок", " И ВыдачаПодарков.Подарок = &Подарок");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &Подарок", "");		
	КонецЕсли;
	
	пПричина = КомпоновщикНастроек.ПараметрыДанных.Элементы.Найти("Причина");
	Если пПричина <> Неопределено
			И пПричина.Использование Тогда
		Запрос.УстановитьПараметр("Причина", пПричина.Значение);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &Причина", " И ВыдачаПодарков.Причина = &Причина");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &Причина", "");		
	КонецЕсли;

	пМенеджер = КомпоновщикНастроек.ПараметрыДанных.Элементы.Найти("Менеджер");
	Если пМенеджер <> Неопределено
			И пМенеджер.Использование Тогда
		Запрос.УстановитьПараметр("Менеджер", пМенеджер.Значение);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &Менеджер", " И ВыдачаПодарков.Ответственный = &Менеджер");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &Менеджер", "");			
	КонецЕсли;
	//
	пКлиент = КомпоновщикНастроек.ПараметрыДанных.Элементы.Найти("Клиент");
	Если пКлиент <> Неопределено
			И пМенеджер.Использование Тогда
		Запрос.УстановитьПараметр("Клиент", пКлиент.Значение);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &Клиент", " И ВыдачаПодарков.Клиент = &Клиент");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &Клиент", "");			
	КонецЕсли;
	

КонецПроцедуры


#КонецОбласти
